In [10]:
import pandas as pd
import numpy as np
import random

In [11]:
diamonds = pd.read_csv('../ml_data/diamonds.csv',
                       usecols=['color', 'price'])

In [12]:
diam = diamonds.copy()

In [13]:
diamonds.head()

  color  price
0     E    326
1     E    326
2     E    327
3     I    334
4     J    335

In [14]:
diam_mean_orginal = diam.groupby(by='color').mean()

In [15]:
diam_mean_orginal.head()

             price
color
D      3169.954096
E      3076.752475
F      3724.886397
G      3999.135671
H      4486.669196

In [23]:
missing_data = random.sample(range(0, diam.shape[0]), k=5)

In [24]:
missing_data

[16902, 3225, 21011, 8978, 28509]

In [25]:
diam.loc[missing_data]

      color  price
16902     G   6748
3225      D   3352
21011     G   9225
8978      D   4505
28509     F    673

In [38]:
diam.shape[0]

53940

In [43]:
diam.loc[missing_data, 'price'] = np.NAN

In [44]:
diam.loc[missing_data]

      color  price
16902     G    NaN
3225      D    NaN
21011     G    NaN
8978      D    NaN
28509     F    NaN

In [45]:
diam_mean_start = diam.groupby(by='color').mean()

In [47]:
diam_mean_orginal.head()

             price
color
D      3169.954096
E      3076.752475
F      3724.886397
G      3999.135671
H      4486.669196

In [49]:
diam_mean_orginal - diam_mean_start

          price
color
D      0.223991
E      0.000000
F     -0.319871
G      0.706353
H      0.000000
I      0.000000
J      0.000000

In [51]:
filter_nan = np.isnan(diam['price'])

In [54]:
filter_nan.value_counts()

False    53935
True         5
Name: price, dtype: int64

In [76]:
diam.loc[filter_nan, ]

      color        price
7099      F  3724.840059
33073     H  4487.111526
39366     G  3999.394739
40891     E  3076.946509
46342     D  3170.162533

In [77]:
diam.loc[filter_nan, 'color'].map(diam_mean_start['price'])

7099     3724.840059
33073    4487.111526
39366    3999.394739
40891    3076.946509
46342    3170.162533
Name: color, dtype: float64

In [78]:
diam.loc[filter_nan, 'price'] = diam.loc[filter_nan, 'color'].map(diam_mean_start['price'])

In [79]:
diam.loc[filter_nan, 'price']

7099     3724.840059
33073    4487.111526
39366    3999.394739
40891    3076.946509
46342    3170.162533
Name: price, dtype: float64

In [80]:
diam_mean_repair = diam.groupby(by='color').mean()

In [81]:
diam_mean_repair

             price
color
D      3170.162533
E      3076.946509
F      3724.840059
G      3999.394739
H      4487.111526
I      5091.874954
J      5323.818020

In [83]:
diam_mean_start - diam_mean_repair

       price
color
D        0.0
E        0.0
F        0.0
G        0.0
H        0.0
I        0.0
J        0.0

In [84]:
diam_mean_original - diam_mean_start

          price
color
D     -0.208437
E     -0.194034
F      0.046338
G     -0.259068
H     -0.442330
I      0.000000
J      0.000000

In [85]:
diam_mean_original - diam_mean_repair

          price
color
D     -0.208437
E     -0.194034
F      0.046338
G     -0.259068
H     -0.442330
I      0.000000
J      0.000000